### 📋 Terraform Plan Results

#### Format Check 🎨
`failure`

#### Initialization ⚙️
`success`

#### Validation ✅
`success`

#### Plan 📊
`success`

<details>
<summary>Show Plan</summary>

```terraform
data.aws_route53_zone.main[0]: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.available: Reading...
data.aws_route53_zone.main[0]: Read complete after 0s [id=Z0041593OSPVTJX3N306]
data.aws_availability_zones.available: Read complete after 1s [id=ap-northeast-2]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-010be25c3775061c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.cdn will be created
  + resource "aws_acm_certificate" "cdn" {
      + arn                       = (known after apply)
      + domain_name               = "images.growbin.app"
      + domain_validation_options = [
          + {
              + domain_name           = "images.growbin.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "images.growbin.app",
        ]
      + tags                      = {
          + "Environment" = "prod"
          + "Name"        = "images.growbin.app"
          + "Purpose"     = "CloudFront CDN SSL"
        }
      + tags_all                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "images.growbin.app"
          + "Project"     = "SeSACTHON"
          + "Purpose"     = "CloudFront CDN SSL"
          + "Team"        = "Backend"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.main[0] will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "growbin.app"
      + domain_validation_options = [
          + {
              + domain_name           = "*.growbin.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "growbin.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.growbin.app",
          + "growbin.app",
        ]
      + tags                      = {
          + "Name" = "prod-wildcard-cert"
        }
      + tags_all                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-wildcard-cert"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cdn will be created
  + resource "aws_acm_certificate_validation" "cdn" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.main[0] will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.images will be created
  + resource "aws_cloudfront_distribution" "images" {
      + aliases                         = [
          + "images.growbin.app",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "CDN for waste analysis images - prod"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Name"        = "prod-images-cdn"
          + "Purpose"     = "Image delivery optimization"
        }
      + tags_all                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-images-cdn"
          + "Project"     = "SeSACTHON"
          + "Purpose"     = "Image delivery optimization"
          + "Team"        = "Backend"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 403
        }
      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 404
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 604800
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.images will be created
  + resource "aws_cloudfront_origin_access_identity" "images" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "OAI for prod-sesacthon S3 images bucket"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_iam_instance_profile.k8s will be created
  + resource "aws_iam_instance_profile" "k8s" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "k8s-instance-profile-prod"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "k8s-node-role-prod"
      + tags        = {
          + "Environment" = "prod"
          + "Name"        = "k8s-instance-profile"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "k8s-instance-profile"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.alb_controller will be created
  + resource "aws_iam_policy" "alb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for AWS Load Balancer Controller"
      + id               = (known after apply)
      + name             = "prod-alb-controller-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoalescedAddress",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:SetRulePriorities",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "prod-alb-controller-policy"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-alb-controller-policy"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
    }

  # aws_iam_policy.cloudwatch will be created
  + resource "aws_iam_policy" "cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch logging"
      + id               = (known after apply)
      + name             = "k8s-cloudwatch-policy-prod"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
    }

  # aws_iam_policy.ecr_read will be created
  + resource "aws_iam_policy" "ecr_read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for reading from ECR"
      + id               = (known after apply)
      + name             = "k8s-ecr-read-policy-prod"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
    }

  # aws_iam_policy.s3_access will be created
  + resource "aws_iam_policy" "s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for S3 access"
      + id               = (known after apply)
      + name             = "k8s-s3-access-policy-prod"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::ecoeco-*",
                          + "arn:aws:s3:::ecoeco-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
    }

  # aws_iam_policy.s3_presigned_url will be created
  + resource "aws_iam_policy" "s3_presigned_url" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "S3 Pre-signed URL 생성 권한 (Backend)"
      + id               = (known after apply)
      + name             = "prod-s3-presigned-url-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "prod-s3-presigned-url-policy"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-s3-presigned-url-policy"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
    }

  # aws_iam_role.k8s_node will be created
  + resource "aws_iam_role" "k8s_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "k8s-node-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Name"        = "k8s-node-role"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "k8s-node-role"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.alb_controller will be created
  + resource "aws_iam_role_policy_attachment" "alb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-node-role-prod"
    }

  # aws_iam_role_policy_attachment.cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-node-role-prod"
    }

  # aws_iam_role_policy_attachment.ecr_read will be created
  + resource "aws_iam_role_policy_attachment" "ecr_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-node-role-prod"
    }

  # aws_iam_role_policy_attachment.s3_access will be created
  + resource "aws_iam_role_policy_attachment" "s3_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-node-role-prod"
    }

  # aws_iam_role_policy_attachment.s3_backend will be created
  + resource "aws_iam_role_policy_attachment" "s3_backend" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-node-role-prod"
    }

  # aws_route53_record.cdn will be created
  + resource "aws_route53_record" "cdn" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "images.growbin.app"
      + type            = "A"
      + zone_id         = "Z0041593OSPVTJX3N306"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cdn_cert_validation["images.growbin.app"] will be created
  + resource "aws_route53_record" "cdn_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0041593OSPVTJX3N306"
    }

  # aws_route53_record.cert_validation["*.growbin.app"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0041593OSPVTJX3N306"
    }

  # aws_route53_record.cert_validation["growbin.app"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0041593OSPVTJX3N306"
    }

  # aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-sesacthon-images"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "prod-sesacthon-images"
          + "Purpose"     = "AI 분석용 이미지 저장"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-sesacthon-images"
          + "Project"     = "SeSACTHON"
          + "Purpose"     = "AI 분석용 이미지 저장"
          + "Team"        = "Backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_cors_configuration.images will be created
  + resource "aws_s3_bucket_cors_configuration" "images" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "http://localhost:3000",
              + "http://localhost:5173",
              + "https://growbin.app",
              + "https://www.growbin.app",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_lifecycle_configuration.images will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "images" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup-old-images"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # aws_s3_bucket_policy.images_cdn will be created
  + resource "aws_s3_bucket_policy" "images_cdn" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.images will be created
  + resource "aws_s3_bucket_public_access_block" "images" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.images will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "images" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.images will be created
  + resource "aws_s3_bucket_versioning" "images" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.security_groups.aws_security_group.master will be created
  + resource "aws_security_group" "master" {
      + arn                    = (known after apply)
      + description            = "Security group for Kubernetes Master node"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Kubernetes API"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "NodePort Services"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from allowed CIDR"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Kubelet API self"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = []
              + description      = "VXLAN for Calico"
              + from_port        = 4789
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 4789
            },
          + {
              + cidr_blocks      = []
              + description      = "etcd"
              + from_port        = 2379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 2380
            },
          + {
              + cidr_blocks      = []
              + description      = "kube-controller-manager"
              + from_port        = 10257
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 10257
            },
          + {
              + cidr_blocks      = []
              + description      = "kube-scheduler"
              + from_port        = 10259
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 10259
            },
        ]
      + name                   = "prod-k8s-master-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-k8s-master-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-k8s-master-sg"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group.worker will be created
  + resource "aws_security_group" "worker" {
      + arn                    = (known after apply)
      + description            = "Security group for Kubernetes Worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from allowed CIDR"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "VXLAN for Calico"
              + from_port        = 4789
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 4789
            },
          + {
              + cidr_blocks      = []
              + description      = "Worker to worker communication"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "kube-proxy health"
              + from_port        = 10256
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 10256
            },
        ]
      + name                   = "prod-k8s-worker-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-k8s-worker-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-k8s-worker-sg"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group_rule.master_to_worker_all will be created
  + resource "aws_security_group_rule" "master_to_worker_all" {
      + description              = "All traffic from master"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.master_to_worker_kubelet will be created
  + resource "aws_security_group_rule" "master_to_worker_kubelet" {
      + description              = "Kubelet API from worker"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10252
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.master_to_worker_vxlan will be created
  + resource "aws_security_group_rule" "master_to_worker_vxlan" {
      + description              = "VXLAN from master (Calico)"
      + from_port                = 4789
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4789
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_nodeport will be created
  + resource "aws_security_group_rule" "worker_nodeport" {
      + description              = "NodePort from master"
      + from_port                = 30000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 32767
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_to_master_api will be created
  + resource "aws_security_group_rule" "worker_to_master_api" {
      + description              = "Kubernetes API from worker"
      + from_port                = 6443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_to_master_kubelet will be created
  + resource "aws_security_group_rule" "worker_to_master_kubelet" {
      + description              = "Kubelet API from master"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_to_master_vxlan will be created
  + resource "aws_security_group_rule" "worker_to_master_vxlan" {
      + description              = "VXLAN from worker (Calico)"
      + from_port                = 4789
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4789
      + type                     = "ingress"
    }

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "prod-igw"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-igw"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "prod-public-rt"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-public-rt"
          + "Project"     = "SeSACTHON"
          + "Team"        = "Backend"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "prod-public-subnet-1"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "ManagedBy"              = "Terraform"
          + "Name"                   = "prod-public-subnet-1"
          + "Project"                = "SeSACTHON"
          + "Team"                   = "Backend"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "prod-public-subnet-2"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "ManagedBy"              = "Terraform"
          + "Name"                   = "prod-public-subnet-2"
          + "Project"                = "SeSACTHON"
          + "Team"                   = "Backend"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "prod-public-subnet-3"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "ManagedBy"              = "Terraform"
          + "Name"                   = "prod-public-subnet-3"
          + "Project"                = "SeSACTHON"
          + "Team"                   = "Backend"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                                 = "prod-k8s-vpc"
          + "kubernetes.io/cluster/prod-sesacthon" = "shared"
        }
      + tags_all                             = {
          + "Environment"                          = "prod"
          + "ManagedBy"                            = "Terraform"
          + "Name"                                 = "prod-k8s-vpc"
          + "Project"                              = "SeSACTHON"
          + "Team"                                 = "Backend"
          + "kubernetes.io/cluster/prod-sesacthon" = "shared"
        }
    }

Plan: 47 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acm_certificate_arn        = (known after apply)
  + aws_region                 = "ap-northeast-2"
  + cdn_oai_iam_arn            = (known after apply)
  + cdn_url                    = "https://images.growbin.app"
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)
  + cloudfront_info            = {
      + cdn_url             = (known after apply)
      + distribution_domain = (known after apply)
      + distribution_id     = (known after apply)
    }
  + dns_records                = {
      + apex_domain   = "https://growbin.app"
      + api_base      = "https://api.growbin.app"
      + argocd_url    = "https://argocd.growbin.app"
      + auth_url      = "https://api.growbin.app/auth"
      + cdn_url       = "https://images.growbin.app"
      + character_url = "https://api.growbin.app/character"
      + grafana_url   = "https://grafana.growbin.app"
      + location_url  = "https://api.growbin.app/location"
      + my_url        = "https://api.growbin.app/my"
      + nameservers   = [
          + "ns-1292.awsdns-33.org",
          + "ns-439.awsdns-54.com",
          + "ns-1546.awsdns-01.co.uk",
          + "ns-878.awsdns-45.net",
        ]
      + scan_url      = "https://api.growbin.app/scan"
      + www_url       = "https://www.growbin.app"
    }
  + k8s_instance_profile_name  = "k8s-instance-profile-prod"
  + k8s_node_role_arn          = (known after apply)
  + node_roles                 = {
      + api_auth      = "Authentication API (t3.micro, 1GB) - Phase 1"
      + api_character = "Character & Mission API (t3.micro, 1GB) - Phase 2"
      + api_location  = "Location & Map API (t3.micro, 1GB) - Phase 2"
      + api_my        = "My Page API (t3.micro, 1GB) - Phase 1"
      + api_scan      = "Waste Scan API (t3.small, 2GB) - Phase 2"
      + master        = "Control Plane (t3.large, 8GB) - Phase 1"
      + postgresql    = "PostgreSQL - 7 Domain Schemas (t3.medium, 4GB) - Phase 1"
      + redis         = "Redis Cache (t3.small, 2GB) - Phase 1"
    }
  + s3_bucket_info             = {
      + bucket_arn  = (known after apply)
      + bucket_name = (known after apply)
      + region      = "ap-northeast-2"
    }
  + vpc_id                     = (known after apply)
::error::Terraform exited with code 1.

```

</details>

**Pushed by:** @mangowhoiscloud
**Action:** `pull_request`
